# LOAN DATASETS 2024. o'tilgan metodlarni qo'llanishi!!!

In [2]:
import pandas as pd
df=pd.read_csv("loan_datasets.csv")
df.head()

,customer_id,customer_age,customer_income,home_ownership,employment_duration,loan_intent,loan_grade,loan_amnt,loan_int_rate,term_years,historical_default,cred_hist_length,Current_loan_status
0,1.0,22,59000,RENT,123.0,PERSONAL,C,"£35,000.00",16.02,10,Y,3,DEFAULT
1,2.0,21,9600,OWN,5.0,EDUCATION,A,"£1,000.00",11.14,1,NaN,2,NO DEFAULT
2,3.0,25,9600,MORTGAGE,1.0,MEDICAL,B,"£5,500.00",12.87,5,N,3,DEFAULT
3,4.0,23,65500,RENT,4.0,MEDICAL,B,"£35,000.00",15.23,10,N,2,DEFAULT
4,5.0,24,54400,RENT,8.0,MEDICAL,B,"£35,000.00",14.27,10,Y,4,DEFAULT

## numerical data

### mean()---> metodi o'rta qiymatini chiqarish

haridorlar yoshining o'rta qiymati:

In [3]:
df["customer_age"].mean()

np.float64(27.732768673663536)

### sum()---> metodi umumiy summani hisoblash

customer age bo'yicha umumiy summa

In [7]:
df["customer_age"].sum()

np.int64(903700)

### max()--->metodi berilgan column dagi max qiymatni topib beradi

eng keksa xaridorni topish

In [8]:
df["customer_age"].max()

np.int64(144)

## AGG()---> metodi yordamida har bir ustun uchun turli xil aggregat funksiyalarni qo'llash mumkin

In [15]:
df["customer_income"].agg(min)

C:\Users\HP Victus\AppData\Local\Temp\ipykernel_8908\3536796357.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df["customer_income"].agg(min)

'10000'

## CUMSUM()--->metodi har bir elementdan oldingi barcha elementlarning summasini hisoblab beradi

In [16]:
df["term_years"].cumsum()

0            10
1            11
2            16
3            26
4            36
          ...
32581    155145
32582    155149
32583    155154
32584    155160
32585    155166
Name: term_years, Length: 32586, dtype: int64

## DROP_DUPLICATES--->metodi duplicate datalarni o'chirishda ishlatiladi

loan_intent yani kreditni olish niyati ustunidagi xaridorlarni drop_duplicates bo'yicha saralash

In [11]:
df.drop_duplicates("loan_intent")

,customer_id,customer_age,customer_income,home_ownership,employment_duration,loan_intent,loan_grade,loan_amnt,loan_int_rate,term_years,historical_default,cred_hist_length,Current_loan_status
0,1.0,22,59000,RENT,123.0,PERSONAL,C,"£35,000.00",16.02,10,Y,3,DEFAULT
1,2.0,21,9600,OWN,5.0,EDUCATION,A,"£1,000.00",11.14,1,NaN,2,NO DEFAULT
2,3.0,25,9600,MORTGAGE,1.0,MEDICAL,B,"£5,500.00",12.87,5,N,3,DEFAULT
5,6.0,21,9900,OWN,2.0,VENTURE,A,"£2,500.00",7.14,1,N,2,DEFAULT
11,12.0,21,10000,OWN,2.0,HOMEIMPROVEMENT,A,"£4,500.00",8.63,1,N,2,DEFAULT
15,16.0,23,500000,MORTGAGE,7.0,DEBTCONSOLIDATION,A,"£30,000.00",10.65,10,NaN,3,NO DEFAULT

## .VALUE_COUNTS()---> metodi tanlangan columndagi bir xil datalarni nechtaligini aniqlab beradi

kredit olish maqsadi bo'yicha sortlandi va qaysi maqsadda nechta xaridor borligi aniqlandi

In [14]:
df["loan_intent"].value_counts(sort=False)

loan_intent
PERSONAL             5523
EDUCATION            6454
MEDICAL              6072
VENTURE              5718
HOMEIMPROVEMENT      3606
DEBTCONSOLIDATION    5213
Name: count, dtype: int64

## PROPORTIONS

In [15]:
df["home_ownership"].value_counts(normalize=True)*100

home_ownership
RENT        50.484871
MORTGAGE    41.256982
OWN          7.929786
OTHER        0.328362
Name: proportion, dtype: float64

## Qiyin usulda gruhlash

bu yerda ijarachilarni o'rtacha yoshi aniqlandi

In [3]:
df[df["home_ownership"]=="RENT"]["customer_age"].mean()

np.float64(27.545802686766763)

## GROUPBY---> metodi guruhlash uchun qo'llaniladi

bu yerda loan intent bo'yicha guruhlab ularni o'rtacha yoshi aniqlandi

In [26]:
df.groupby("loan_intent")["customer_age"].mean()

loan_intent
DEBTCONSOLIDATION    27.603683
EDUCATION            26.581345
HOMEIMPROVEMENT      29.071547
MEDICAL              27.998024
PERSONAL             28.206047
VENTURE              27.566981
Name: customer_age, dtype: float64

# MULTIPLE SUMMARIES

In [4]:
df.head()

,customer_id,customer_age,customer_income,home_ownership,employment_duration,loan_intent,loan_grade,loan_amnt,loan_int_rate,term_years,historical_default,cred_hist_length,Current_loan_status
0,1.0,22,59000,RENT,123.0,PERSONAL,C,"£35,000.00",16.02,10,Y,3,DEFAULT
1,2.0,21,9600,OWN,5.0,EDUCATION,A,"£1,000.00",11.14,1,NaN,2,NO DEFAULT
2,3.0,25,9600,MORTGAGE,1.0,MEDICAL,B,"£5,500.00",12.87,5,N,3,DEFAULT
3,4.0,23,65500,RENT,4.0,MEDICAL,B,"£35,000.00",15.23,10,N,2,DEFAULT
4,5.0,24,54400,RENT,8.0,MEDICAL,B,"£35,000.00",14.27,10,Y,4,DEFAULT

In [42]:
df['loan_amnt'] = df['loan_amnt'].astype(str).str.replace('£', '').str.replace(',', '').astype(float)
df.head()

,customer_id,customer_age,customer_income,home_ownership,employment_duration,loan_intent,loan_grade,loan_amnt,loan_int_rate,term_years,historical_default,cred_hist_length,Current_loan_status,newbirbolo
0,1.0,22,59000,RENT,123.0,PERSONAL,C,35000.0,16.02,10,Y,3,DEFAULT,"£35,000.00"
1,2.0,21,9600,OWN,5.0,EDUCATION,A,1000.0,11.14,1,NaN,2,NO DEFAULT,"£1,000.00"
2,3.0,25,9600,MORTGAGE,1.0,MEDICAL,B,5500.0,12.87,5,N,3,DEFAULT,"£5,500.00"
3,4.0,23,65500,RENT,4.0,MEDICAL,B,35000.0,15.23,10,N,2,DEFAULT,"£35,000.00"
4,5.0,24,54400,RENT,8.0,MEDICAL,B,35000.0,14.27,10,Y,4,DEFAULT,"£35,000.00"

In [9]:
df[df["customer_age"]==22].groupby("home_ownership")["loan_grade"].value_counts()

home_ownership  loan_grade
MORTGAGE        A             983
                B             225
                C             129
                D              26
                E               6
OTHER           B               6
                C               6
                A               3
OWN             A             202
                B              46
                C              36
                E               2
RENT            A             974
                B             658
                C             246
                D              69
                E              17
Name: count, dtype: int64

In [11]:
df[df["customer_age"]==20].describe()

,customer_id,customer_age,employment_duration,loan_int_rate,term_years,cred_hist_length
count,15.000000,15.0,15.000000,14.000000,15.000000,15.000000
mean,11072.600000,20.0,3.333333,11.640714,2.400000,2.800000
std,4906.315446,0.0,1.234427,2.936938,1.549193,0.941124
min,1314.000000,20.0,0.000000,8.000000,2.000000,2.000000
25%,7538.500000,20.0,3.000000,8.940000,2.000000,2.000000
50%,11903.000000,20.0,4.000000,11.050000,2.000000,2.000000
75%,15123.000000,20.0,4.000000,14.360000,2.000000,4.000000
max,17197.000000,20.0,4.000000,16.020000,8.000000,4.000000

# TYPE CHANGE

In [3]:
df['loan_amnt'] = df['loan_amnt'].astype(str).str.replace('£', '').str.replace(',', '').astype(float)
df.head()

,customer_id,customer_age,customer_income,home_ownership,employment_duration,loan_intent,loan_grade,loan_amnt,loan_int_rate,term_years,historical_default,cred_hist_length,Current_loan_status
0,1.0,22,59000,RENT,123.0,PERSONAL,C,35000.0,16.02,10,Y,3,DEFAULT
1,2.0,21,9600,OWN,5.0,EDUCATION,A,1000.0,11.14,1,NaN,2,NO DEFAULT
2,3.0,25,9600,MORTGAGE,1.0,MEDICAL,B,5500.0,12.87,5,N,3,DEFAULT
3,4.0,23,65500,RENT,4.0,MEDICAL,B,35000.0,15.23,10,N,2,DEFAULT
4,5.0,24,54400,RENT,8.0,MEDICAL,B,35000.0,14.27,10,Y,4,DEFAULT